app/controllers/owners_controller.rb

INSERT INTO "owners" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", nil], ["email", nil], ["created_at", "2023-05-09 05:05:19.794638"], ["updated_at", "2023-05-09 05:05:19.794638"]]
---
  def create
    @owner = Owner.new(owner_params)
    debugger

    if @owner.save