app/controllers/pets_controller.rb

INSERT INTO "pets" ("name", "species", "breed", "age", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Nellie"], ["species", "Dog"], ["breed", "Jack Russell Terrier"], ["age", 4.0], ["owner_id", 1], ["created_at", "2023-05-09 23:58:22.116281"], ["updated_at", "2023-05-09 23:58:22.116281"]]
---
  def create
    @pet = Pet.new(pet_params)

    if @pet.save